[
    {
        "title": "June is Pride Month",
        "link": "https://mhanational.org/node/23886",
        "summary": "<span>June is Pride Month</span>\n\n<span><span lang=\"\" xml:lang=\"\">MHA Admin</span></span>\n\n<span>Wed, 05/31/2023 - 09:38</span>\n\n      <div class=\"field field--name-field-image field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">\n<div class=\"item-image\">\n  <img alt=\"Progressive Pride flag lays over top of two pairs of legs\" src=\"https://mhanational.org/sites/default/files/lgbtq/Pride-2023/Pride-feature.jpg\" /></div>\n</div>\n          </div>\n  \n  <div class=\"field field--name-field-background-color field--type-list-string field--label-above\">\n    <div class=\"field__label\">Background Color</div>\n              <div class=\"field__item\">blue</div>\n          </div>\n\n      <div class=\"field field--name-field-link field--type-link field--label-hidden field__items\">\n              <div class=\"field__item\"><a href=\"https://mhanational.org/lgbtq/pride\">See our LGBTQ+ mental health resources</a></div>\n          </div>"
    },
    {
        "title": "Mental Health Month Toolkit Available",
        "link": "https://mhanational.org/node/23771",
        "summary": "<span>Mental Health Month Toolkit Available</span>\n\n<span><span lang=\"\" xml:lang=\"\">MHA Admin</span></span>\n\n<span>Mon, 03/27/2023 - 09:43</span>\n\n      <div class=\"field field--name-field-image field--type-image field--label-hidden field__items\">\n              <div class=\"field__item\">\n<div class=\"item-image\">\n  <img alt=\"Group of people stand and look over the shoulder of someone working on a notepad\" src=\"https://mhanational.org/sites/default/files/MHM/toolkit-feature.jpg\" /></div>\n</div>\n          </div>\n  \n  <div class=\"field field--name-field-background-color field--type-list-string field--label-above\">\n    <div class=\"field__label\">Background Color</div>\n              <div class=\"field__item\">blue</div>\n          </div>\n\n      <div class=\"field field--name-field-link field--type-link field--label-hidden field__items\">\n              <div class=\"field__item\"><a href=\"https://mhanational.org/mental-health-month\">Find resources and download the toolkit</a></div>\n          </div>"
    },
    {
        "title": "New Report Shines Spotlight on Mental Health in the Workplace",
        "link": "https://mhanational.org/new-report-shines-spotlight-mental-health-workplace",
        "summary": "<span>New Report Shines Spotlight on Mental Health in the Workplace</span>\n\n<span><span lang=\"\" xml:lang=\"\">MHassan</span></span>\n\n<span>Mon, 01/27/2020 - 10:00</span>\n<span class=\"a2a_kit a2a_kit_size_32 addtoany_list\"><a class=\"a2a_button_facebook\"></a><a class=\"a2a_button_twitter\"></a><a class=\"a2a_button_linkedin\"></a><a class=\"a2a_button_instagram\"></a></span>\n            <div class=\"bio date uppercase field field--name-field-date field--type-datetime field--label-hidden field__item\"><time datetime=\"2020-01-27T15:00:00Z\">Monday, January 27, 2020</time></div>\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden field__item\"><p><strong>Alexandria, VA</strong> — MHA is pleased to release a new report focused on the American workforce and mental health, <a href=\"https://mhanational.org/node/17107\">Creating a Healthy Workplace: Impact of Supervisor Support and Company Culture</a>. The findings of this new report complement and expand upon a <a href=\"https://mhanational.org/sites/default/files/Work%20Health%20Survey%202019.pdf\">2019 study</a> that showed that supervisor communication and a company culture of safe and open communication are correlated with an employee’s motivation, confidence, and pride.</p>\n<p>This report expanded upon that understanding, by conducting research that goes beyond those actively seeking mental health support - making clear that across both a help-seeking and non-help-seeking population, an organisational culture of safe and open communication and supervisor support and guidance are important for increasing employee engagement and well-being and creating an overall mentally healthy workplace for all employees. </p>\n<p>Across both populations:</p>\n<ul><li>Supervisor communication is correlated with safety in reporting ethical violations and areas for improvement in the workplace.</li>\n<li>Feeling comfortable to report dishonest or unfair practices was most correlated with pride (whether you would recommend your workplace to others).</li>\n<li>Among all employee well-being measures, pride was the most correlated with supervisor communication and a company culture of safe and open communication.</li>\n<li>People who are the most stressed also reported they were in companies where it was safer to remain silent about their personal problems.</li>\n</ul><p>Therefore, it is imperative that supervisors and other company leadership take action to create a culture of communication and support that will benefit not only those employees that may be seeking resources for their mental health, but every employee in the workplace. Doing so will ultimately improve overall operations.  </p>\n<p>“We know that company culture and engagement can affect employees’ confidence and satisfaction with their jobs,” said Paul Gionfriddo, president and CEO of MHA. “Management should take note – when supervisors support and provide their employees with guidance, it creates a company culture where employees feel equipped and motivated to perform their job well.”</p>\n<p>MHA’s research is part of an ongoing commitment to uncover workplace disparities and addressing the psychological needs of the workforce. MHA seeks to explore factors in work environments that influence employee engagement, workplace stress, and mental health. The research results help inform programs that can be developed and guidance we can give companies to make all workplaces in America successful and healthy.</p>\n</div>"
    },
    {
        "title": "MHA Partners with MedCircle to Launch $5 Million KnowBrainer Mental Health Campaign",
        "link": "https://mhanational.org/mha-partners-medcircle-launch-5-million-knowbrainer-mental-health-campaign",
        "summary": "<span>MHA Partners with MedCircle to Launch $5 Million KnowBrainer Mental Health Campaign</span>\n\n<span><span lang=\"\" xml:lang=\"\">EWallace</span></span>\n\n<span>Mon, 04/29/2019 - 09:03</span>\n<span class=\"a2a_kit a2a_kit_size_32 addtoany_list\"><a class=\"a2a_button_facebook\"></a><a class=\"a2a_button_twitter\"></a><a class=\"a2a_button_linkedin\"></a><a class=\"a2a_button_instagram\"></a></span>\n            <div class=\"bio date uppercase field field--name-field-date field--type-datetime field--label-hidden field__item\"><time datetime=\"2019-04-29T13:00:00Z\">Monday, April 29, 2019</time></div>\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden field__item\"><p><strong>Alexandria, VA </strong>–– Mental Health America (MHA) is excited to announce that it has partnered with <a href=\"http://www.medcircle.com/\">MedCircle</a> on its new KnowBrainer Campaign - an initiative where individuals watch a two-minute video about the brain and MedCircle donates to MHA.</p>\n<p>“MHA is happy to be a part of MedCircle’s innovative KnowBrainer campaign,” said Paul Gionfriddo, MHA president and CEO. “If we want to make progress on addressing mental illness before stage 4, we agree that it’s important for all of us to have a better understanding of the brain.”</p>\n<p>The campaign is designed to be straightforward, according to Doug Colbeth, CEO of MedCircle. Individuals simply watch a two-minute video to learn about an important part of the brain. Viewers then select the charity they want to receive a donation from MedCircle. All donations (up to $5 Million) will be made by the sponsor.</p>\n<p>\"MedCircle is extremely excited to partner with MHA on the KnowBrainer Campaign,” said Colbeth. “This campaign not only raises awareness of mental health conditions, but also provides knowledge about the brain in a fun and informative way. MedCircle believes a better educated population empower individuals to take more control over their mental health care and better support others.\"</p>\n<p>This campaign directly benefits MHA so we can continue to fulfill our mission – to address the needs of those living with mental illness and to promoting the overall health of all Americans.</p>\n<p>###</p>\n<p>About MedCircle<br />\nAccess to the expertise of mental health professionals has become difficult and costly. With a combination of talented experts and proprietary technology, MedCircle provides the expertise of widely recognized professionals in an accessible and affordable manner. The company’s innovative video streaming service is bringing the expertise of the best Doctors to the world - in an accessible and affordable manner. The co-founders of MedCircle are Douglas and Margaret Colbeth - who for decades have been pioneer philanthropists in the mental health arena. Most notably, they opened The Colbeth Clinic for Children & Adolescent Psychiatry in 2002. This innovative mental health outpatient clinic located in Chicago has treated thousands of primarily inner-city children.</p>\n</div>"
    },
    {
        "title": "MHA Statement on House Resolution 1112",
        "link": "https://mhanational.org/mha-statement-house-resolution-1112",
        "summary": "<span>MHA Statement on House Resolution 1112</span>\n\n<span><span lang=\"\" xml:lang=\"\">EWallace</span></span>\n\n<span>Fri, 03/01/2019 - 11:21</span>\n<span class=\"a2a_kit a2a_kit_size_32 addtoany_list\"><a class=\"a2a_button_facebook\"></a><a class=\"a2a_button_twitter\"></a><a class=\"a2a_button_linkedin\"></a><a class=\"a2a_button_instagram\"></a></span>\n            <div class=\"bio date uppercase field field--name-field-date field--type-datetime field--label-hidden field__item\"><time datetime=\"2019-03-01T11:15:00Z\">Friday, March 1, 2019</time></div>\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden field__item\"><p><em>By: Paul Gionfriddo, president and CEO, MHA</em></p>\n<p>“Mental Health America is deeply disappointed that in HR 1112, language is included that perpetuates historic, unfair and unfounded assumptions and prejudices about people experiencing or living with a mental health condition. It is built upon the widely held, but erroneous, belief that equates mental illness with violence.</p>\n<p>“Studies confirm that less than 4% of violent crime, of any type, is committed by persons with a diagnosed mental illness. The greatest indicator of violence is past violence, not a mental illness diagnosis. Millions of people have mental illnesses and <em>never</em> have a violent thought or idea. <span style=\"background-color: white;\">In fact, people with severe mental illnesses are more likely be victims of violence. </span></p>\n<p>“This is why what may be a well-intentioned move away from the antiquated term “mental defective,” to “<span style=\"background-color: white;\">adjudicated with mental illness, severe developmental disability, or severe emotional instability”</span> stills fall far short, and remains blatantly discriminatory in its substance and implications.   </p>\n<p>“Experiencing an episode that affects one’s mental health, living with a mental illness, experiencing emotional disturbance, or having developmental disability is not something to which a person is or should be adjudicated by the judicial system, nor should it or does it automatically imply dangerousness.</p>\n<p>“MHA is working closely with its allies to see that legislative language regarding prohibitions or restrictions regarding firearms reflects the fact that there are times when a person may be and should be deemed to be ineligible to purchase or possess a firearm due to their mental status, it is not solely because they experience or have experienced a mental condition.”</p>\n</div>"
    },
    {
        "title": "MHA Honors Governor Gina Raimondo with 2019 B4Stage4 Leadership Award",
        "link": "https://mhanational.org/mha-honors-governor-gina-raimondo-2019-b4stage4-leadership-award",
        "summary": "<span>MHA Honors Governor Gina Raimondo with 2019 B4Stage4 Leadership Award</span>\n\n<span><span lang=\"\" xml:lang=\"\">EWallace</span></span>\n\n<span>Fri, 02/22/2019 - 09:08</span>\n<span class=\"a2a_kit a2a_kit_size_32 addtoany_list\"><a class=\"a2a_button_facebook\"></a><a class=\"a2a_button_twitter\"></a><a class=\"a2a_button_linkedin\"></a><a class=\"a2a_button_instagram\"></a></span>\n            <div class=\"bio date uppercase field field--name-field-date field--type-datetime field--label-hidden field__item\"><time datetime=\"2019-02-22T09:00:00Z\">Friday, February 22, 2019</time></div>\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden field__item\"><p>\nWashington, DC — Mental Health America (MHA) will gather this evening at The National Press Club to celebrate its 110th birthday and honor Governor Gina Raimondo of Rhode Island for her work to address mental illness Before Stage 4. MHA awards its <em>2019 B4Stage4 Leadership Award</em> to Governor Raimondo for her leadership and commitment to strengthening behavioral health in Rhode Island through the provision of mental health services for students, increasing access to mental health and substance use disorder treatment, and supporting behavioral health parity.</p>\n<p>“Addressing mental health concerns Before Stage 4 means more than waiting for a mental health crisis to occur before we act,” said Paul Gionfriddo, president and CEO of MHA. “We must continue to improve access to care, services and supports. And we need to put a premium on early identification and early intervention for everyone with mental health concerns. We must address these crises before tragedies strike—and Governors play a critical role in accomplishing this.”</p>\n<p>Governor Raimondo has worked closely with advocates, including MHA Rhode Island, in support of the <a href=\"https://riparity.org/\">Mental Health Parity Initiative</a>, and she signed an Executive Order that directs state agencies to expand access to treatment for people living with mental illness or substance use disorders, ensure parity between physical and mental health, and encourage people to seek treatment when needed. The three main goals outlined in the Governor's order are improved access to mental health treatment specialists; development of a plan to lower the costs of mental health treatment; and working to eliminate the stigma associated with mental illness.</p>\n<p>Arguing that as a matter of public policy, mental illnesses are the only chronic diseases or conditions that we wait until Stage 4 to treat – and then often inappropriately only through incarceration, MHA branded its B4Stage4 philosophy in 2014 as a means of treating mental health concerns as public health - not public safety - issues, and drawing attention to the need for early detection and early intervention to promote recovery and health, just as we do with other chronic diseases. MHA created the <em>B4Stage4 Leadership Award</em> in 2016 to highlight the important work of Governors around the country on these issues.</p>\n<p>“Now is the time for leadership on this issue, and MHA is happy to see the Governor of Rhode Island walk the walk on mental health reform,” concluded Gionfriddo. “We hope that every state prioritizes mental health, now and in the coming years—our goal is to someday be able to give the MHA <em>B4Stage4 Leadership Award </em>to every single Governor in this country.”</p>\n</div>"
    },
    {
        "title": "Mental Health America and Walk the Talk America Join Forces to Combat Suicide",
        "link": "https://mhanational.org/mental-health-america-and-walk-talk-america-join-forces-combat-suicide",
        "summary": "<span>Mental Health America and Walk the Talk America Join Forces to Combat Suicide</span>\n\n<span><span lang=\"\" xml:lang=\"\">EWallace</span></span>\n\n<span>Tue, 01/22/2019 - 12:46</span>\n<span class=\"a2a_kit a2a_kit_size_32 addtoany_list\"><a class=\"a2a_button_facebook\"></a><a class=\"a2a_button_twitter\"></a><a class=\"a2a_button_linkedin\"></a><a class=\"a2a_button_instagram\"></a></span>\n            <div class=\"bio date uppercase field field--name-field-date field--type-datetime field--label-hidden field__item\"><time datetime=\"2019-01-22T12:45:00Z\">Tuesday, January 22, 2019</time></div>\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden field__item\"><p><strong>Alexandria, VA</strong> - Mental Health America (MHA) and Walk the Talk America (WTTA) announced today a partnership to prevent suicide death by firearms by creating materials and conducting outreach to gun ranges across the country in an effort to share information about depression and warning signs that someone may be considering suicide. Their formal partnership officially begins today at the Shot Show in Las Vegas, where they will be openly engaging with firearm industry representatives, gun owners, gun sellers, and those that use firearms professionally.</p>\n<p>MHA is is dedicated to addressing the needs of those living with mental illness and to promoting the overall mental health of all Americans. Much of MHA’s work is guided by the Before Stage 4 (B4Stage4) philosophy – that mental health conditions should be treated long before they reach the most critical points. Like other conditions, MHA believes in the need to address symptoms early, identify the underlying issues, and plan an appropriate course of action on a path towards overall health. MHA is teaming up with WTTA, a new organization founded by several in the firearm industry whose mission is to reduce incidents of suicide by firearms; gun negligence through education and proactive programs that identify risks; raise awareness; and provide solutions to those who choose to own firearms responsibly and the public at large.</p>\n<p>While the large majority of people with a mental illness are never violent, suicide is the 10th leading cause of death in the United States and 2nd among adolescents and young adults aged 10 to 24 years old. Each year, more than 40,000 people die by suicide in the United States. On average, that’s 123 Americans each day. Many, many more people attempt suicide than complete it. In fact, 90 percent of those that attempt to kill themselves don’t die, and they don’t go on to die later by suicide. But means do matter. If someone is considering suicide, having access to a firearm greatly increases the chances of dying. Eighty-five percent of people who attempt suicide with a firearm do die.</p>\n<p>“We know we can’t prevent every suicide attempt, but it’s important that we put politics aside to provide information and resources to those who need it – wherever they are,” said Debbie Plotnick, MHA Vice President of Mental Health and Systems Advocacy. “This campaign is not about taking individuals’ guns away, and it is not a campaign that is saying guns are good or bad. It’s about knowing the signs of depression and suicide – and working together in an effort to save lives. We want to let people know that if they or someone they love is suicidal, it’s OK to ask for help.”</p>\n<p>MHA and WTTA will work together in the following ways:</p>\n<ul><li>MHA and WTTA will conduct outreach to gun sellers and ranges throughout the country in an effort to provide suicide prevention resources to their employees and customers; and will create and distribute materials about the warning signs of depression and how to identify if someone is having suicidal thoughts.</li>\n<li>MHA’s anonymous online screening program – <a href=\"http://www.mhascreening.org\">www.mhascreening.org</a> – is now also available through the WTTA website: <a href=\"https://screening.mentalhealthamerica.net/screening-tools?ref=WTTA\">bit.ly/WTTAScreen</a>.</li>\n<li>MHA and WTTA will develop a certification program that will allow sellers and gun range owners and staff to have knowledge about mental health conditions and warning signs of suicide – and give them the tools to know what to do if they encounter someone who may be suicidal. </li>\n</ul><p>\"Working with MHA is crucial to WTTA's success, said Mike Sodini, founder of WTTA. “When we stand together, we are stronger. We are at epidemic levels of suicide in this country, and existing stigma and blame are getting in the way of real talk about depression, suicide and guns. It’s time to work together to find real solutions to the problem of suicide.”</p>\n<p><em>MHA Contact: Erin Wallace, 571-319-9594, <a href=\"mailto:ewallace@mentalhealthamerica.net\">ewallace@mentalhealthamerica.net</a><br /><br />\n\tWTTA Contact: Mike Sodini, 702-600-2700, <a href=\"mailto:mikesodini@gmail.com\" target=\"_blank\">mikesodini@gmail.com</a></em></p>\n<p> </p>\n</div>"
    },
    {
        "title": "Mental Health America Honors State Legislators Championing Mental Health",
        "link": "https://mhanational.org/mental-health-america-honors-state-legislators-championing-mental-health",
        "summary": "<span>Mental Health America Honors State Legislators Championing Mental Health </span>\n\n<span><span lang=\"\" xml:lang=\"\">EWallace</span></span>\n\n<span>Thu, 12/06/2018 - 09:51</span>\n<span class=\"a2a_kit a2a_kit_size_32 addtoany_list\"><a class=\"a2a_button_facebook\"></a><a class=\"a2a_button_twitter\"></a><a class=\"a2a_button_linkedin\"></a><a class=\"a2a_button_instagram\"></a></span>\n            <div class=\"bio date uppercase field field--name-field-date field--type-datetime field--label-hidden field__item\"><time datetime=\"2018-12-06T09:45:00Z\">Thursday, December 6, 2018</time></div>\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden field__item\"><p><strong>Alexandria, VA </strong>— Mental Health America (MHA) will be recognizing today a select group of state legislators who have earned the title of “Mental Health and Substance Use Disorder Champions.” They will be honored at MHA’s Regional Policy Council (RPC) meeting, which coincides with the Council of State Governments National Conference in Northern Kentucky/Greater Cincinnati today.</p>\n<ul><li>Kentucky Representative Joni Jenkins, member of the Child Welfare and Oversight Committee. She is the founder of the South Louisville Opioid Task Force and leads a bi-partisan effort to improve adoption, foster care, child abuse, child neglect and access to health care, including mental health and substance use for Kentucky’s citizens.</li>\n<li>Kentucky Representative McKenzie Cantrell, member of the Economic and Workforce Development Committee. She is dedicated to healthy work environments, and is outspoken about concerns of parents who are incarcerated for substance abuse issues. She is a strong advocate for improvements in treatment opportunities for families and children affected by substance abuse.</li>\n<li>Ohio Representative Scott Ryan, Chair of the Finance Committee. He has been dedicated to bringing new money to invest in prevention, treatment, mental health care, and workforce programs through the HOPES (Heroin, Opioids, Prevention, Education and Safety) Agenda.</li>\n<li>Illinois Senator-elect Laura Fine currently serves in the Illinois House of Representatives and is the Chair of the Insurance Committee and Vice Chair of the Mental Health Committee. She has championed parity, telepsychiatry, and accessibility for mental health treatment for youth. </li>\n<li>Delaware Representative David Bentz, Chair of the Health and Human Development Committee. He has sponsored legislation that created an overdose system of care, strengthened Delaware’s parity law, and created the Behavioral Health Consortium (BHC). </li>\n<li>Tennessee Senator (Dr.) Richard Briggs, Chair of the Senate Ethics Committee and member of the Health and Welfare Committee. He was a practicing physician for 37 years, (including serving as an army combat trauma surgeon) and has devoted his work to serving his country and our nation’s veterans. He is is committed to building a mental health system which is responsive to the needs of his states’ citizens.</li>\n<li>New Jersey Senator Thomas Kean is the Senate Minority and a member of the Senate Higher Education, the Senate Commerce and the Legislative Oversight Committees, where concerns from constituents about denials of care and lack of access to mental health services have moved him to become a champion for mental health parity.</li>\n</ul><p>“MHA is honored to recognize these distinguished, dedicated, bipartisan public officials,” said Debbie Plotnick, MHA Vice President of Mental Health and Systems Advocacy. “They are dedicated to assuring, protecting and increasing fair access to mental health and substance use disorder treatment.”</p>\n<p>The RPC Meeting <em>Stepping Over Barriers and Building Bridges for Access to Treatment B4Stage 4</em> is being held in the Grand Gazebo Ballroom at the Cincinnati Marriott RiverCenter, 10 W Rivercenter Blvd, Covington, KY.</p>\n<p> </p>\n</div>"
    },
    {
        "title": "MHA Statement on Thousand Oaks Shooting",
        "link": "https://mhanational.org/mha-statement-thousand-oaks-shooting",
        "summary": "<span>MHA Statement on Thousand Oaks Shooting</span>\n\n<span><span lang=\"\" xml:lang=\"\">EWallace</span></span>\n\n<span>Thu, 11/08/2018 - 13:55</span>\n<span class=\"a2a_kit a2a_kit_size_32 addtoany_list\"><a class=\"a2a_button_facebook\"></a><a class=\"a2a_button_twitter\"></a><a class=\"a2a_button_linkedin\"></a><a class=\"a2a_button_instagram\"></a></span>\n            <div class=\"bio date uppercase field field--name-field-date field--type-datetime field--label-hidden field__item\"><time datetime=\"2018-11-08T14:00:00Z\">Thursday, November 8, 2018</time></div>\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden field__item\"><p><em>By: Paul Gionfriddo, president and CEO</em></p>\n<p>\"This morning, we were awakened to the horror of yet another mass shooting – this time at a nightclub in southern California. It is hard to ignore the shock of such news, and impossible at this early stage to determine the motive of the 28-year-old shooter.</p>\n<p>\"What we do know is this. The families of the 12 who died and the hundreds who survived will be affected by this event for the rest of their lives. Long after the physical wounds have healed, the trauma will remain. It is critically important that we recognize and understand this and do all that we can to offer the help and support that these individuals, families, and loved ones need.</p>\n<p>“We will never know if this tragedy could have been prevented if the killer had received appropriate mental health treatment. But we do know that too often in this country, we wait until Stage 4 to address mental illness. Many people who need treatment for a variety of mental illnesses, including PTSD, cannot get it due to lack of access and affordability – and policymakers force too many to wait until a crisis stage before asking for help.</p>\n<p>“It is time we invest in the overall physical and mental well-being of all our citizens – every day. Like other conditions, we can and should address mental health concerns and symptoms early and plan an appropriate course of action on a path towards overall health. Prevention, early identification and intervention are essential to recovery.</p>\n<p>“It is past time that we begin to act before crises occur, to prevent them and the horrible sadness they invariably leave in their wake.</p>\n<p>“Mental Health America will continue to work for prevention and early intervention services, for integration, for peer-to-peer services, and for all services leading to recovery; for protection of the essential mental health benefits people need; for parity protections; and for choices in care, services, and supports for people with mental health concerns. We sincerely hope that all of our public officials will do the same - and act before they talk.</p>\n<p>“MHA also encourages people to use our Online Screening Program and Screening 2 Support (S2S) resources (<a href=\"http://www.MHAScreening.org\">www.MHAScreening.org</a>) to find help and support. If you or someone you love is feeling overwhelmed by what has happened and needs someone to talk to, please call 1-800-273-TALK (8255) or text MHA to 741-741.</p>\n<p>\"In the coming days and weeks, we hope that we will gain insight into why this kind of violence occurs - seemingly with no reason - and why we seem to be experiencing these violent acts with increasing frequency. Thoughts and prayers are not enough –we have to find ways to prevent these events from occurring.\"</p>\n</div>"
    },
    {
        "title": "New MHA Report Shows Many in Crisis, Trauma in Youth Having Lasting Impact in Schools and Beyond",
        "link": "https://mhanational.org/new-mha-report-shows-many-crisis-trauma-youth-having-lasting-impact-schools-and-beyond",
        "summary": "<span>New MHA Report Shows Many in Crisis, Trauma in Youth Having Lasting Impact in Schools and Beyond</span>\n\n<span><span lang=\"\" xml:lang=\"\">EWallace</span></span>\n\n<span>Wed, 10/31/2018 - 09:23</span>\n<span class=\"a2a_kit a2a_kit_size_32 addtoany_list\"><a class=\"a2a_button_facebook\"></a><a class=\"a2a_button_twitter\"></a><a class=\"a2a_button_linkedin\"></a><a class=\"a2a_button_instagram\"></a></span>\n            <div class=\"bio date uppercase field field--name-field-date field--type-datetime field--label-hidden field__item\"><time datetime=\"2018-10-31T09:15:00Z\">Wednesday, October 31, 2018</time></div>\n      \n            <div class=\"field field--name-body field--type-text-with-summary field--label-hidden field__item\"><p><strong>Alexandria, VA</strong> – For the fifth year in a row, Mental Health America (MHA) released its annual <a href=\"http://www.mentalhealthamerica.net/sites/default/files/2019%20MH%20in%20America%20Final.pdf\">State of Mental Health Report</a>, which ranks all 50 states and the District of Columbia based on several mental health and access measures. This year, Minnesota came out on top overall with Nevada coming in 51st. The report also dives into addressing trauma in youth, and its long-term impact on performance and behavior in school.</p>\n<p>In developing the report, MHA looked at 15 different measures to determine the rankings. MHA hopes to provide a snapshot of mental health status among youth and adults for policy and program planning, analysis, and evaluation; to track changes in prevalence of mental health issues and access to mental health care; to understand how changes in national data reflect the impact of legislation and policies; and to increase the dialogues and improve outcomes for individuals and families with mental health needs.</p>\n<p>While much of the state of our mental health care continues to be broken, there are glimmers of hope. Since the release of its first report, MHA is seeing small yet encouraging decreases in the number of American adults who have mental health concerns (from 18.19% to 18.07%) and substance use problems (from 8.76% to 7.93%). Yet overall, the picture is still quite bleak.</p>\n<p>“Sadly, our report shows that there have been alarming increases in adult suicidal thoughts and major depression in youth,” said Paul Gionfriddo, president and CEO, Mental Health America. “Despite mental health being something that more and more people are talking about - far too many people are still suffering. People are simply not receiving the treatment they need to live healthy and productive lives - and too many don’t see a way out.”</p>\n<p>The estimated number of adults with serious suicidal thoughts is over 9.8 million – an increase of 200,000 people since last year. Over 2 million young people cope with severe major depression. And that is just the population that has been diagnosed. On average, it takes 10 years between the onset of symptoms and when individuals receive treatment. Over 24 million individuals experiencing a mental health illness are going untreated.</p>\n<p>MHA’s report also shines the spotlight on childhood trauma and its impact long-term, and releases data that shows how much trauma can impact youth in school. Trauma-impacted youth are more likely to be absent from school, find themselves removed from classrooms, or struggle with academics. As part of MHA’s <a href=\"http://www.mhascreening.org\">Online Screening Program</a>, in 2015 MHA offered an anonymous youth screen, the Pediatric Symptoms Checklist (PSC).</p>\n<p>Since the PSC has been offered, 116,683 youth have been screened and 569 self-selected to identify themselves as trauma survivors. Of those who self-described:</p>\n<ul><li>67% of screeners stated they often have trouble concentrating in school.</li>\n<li>73% reported the often felt sad or unhappy, with 64% reporting they often felt hopeless.</li>\n<li>58% stated they had experienced trouble with their teachers, and the same percentage reported they had engaged in fights with other children.</li>\n<li>66% reported they often felt irritable or angry.</li>\n<li>Of those who identified as trauma survivors, 94% also scored positive for PTSD; 68% screened positive for Severe Depression; 96% screened at-risk for psychosis, and 63% screened positive for Bipolar.</li>\n<li>43% of youth who identified as trauma survivors were not receiving mental health treatment or support, with 40% stating they had never received any mental health treatment or support.</li>\n</ul><p>MHA strongly supports integrating mental health services into the education system. Mental health interventions have show to shorten episodes of mental health conditions and prevent the development of more severe conditions, and schools can play a critical part by implementing trauma-informed programs that have been shown to help students who have been impacted by trauma. </p>\n<p>“Our children are crying out for help,” concluded Gionfriddo. “We must continue to improve access to care and treatments, and we need to put a premium on early identification and early intervention for everyone with mental health concerns. We must address these mental health concerns before crisis and tragedy strikes—before Stage 4.”</p>\n</div>"
    },
    {
        "title": "Living With Major Depressive Disorder",
        "link": "https://www.webmd.com/depression/features/live-with-mdd?src=RSS_PUBLIC",
        "summary": "See how one person manages the ups and downs of major depressive disorder -- and how her depression inspired her career as a therapist."
    },
    {
        "title": "Handling the Stigma",
        "link": "https://www.webmd.com/depression/features/mdd-stigma?src=RSS_PUBLIC",
        "summary": "Learn from a mental health advocate how the stigma of depression is changing and how acceptance is the first step to managing major depressive disorder."
    }
]